#language:ru

Функционал: Информация о курсе
  Для того, чтобы узнать подробнее о курсе
  Как обычный пользователь
  Я должен иметь возможность перейти на страницу о курсе

  @courseDetails
  Сценарий: Выведение информации о курсе
    Допустим я нахожусь на странице "Главная"
    Когда я кликаю по карточке курса
    И я вижу название курса
    И я вижу кнопку "Поступить на курс"
    И я вижу кнопку "Хочу пройти"
    И я вижу название "Преподватель"
    И я вижу название "Программа курса"
    То я вижу название "Отзывы прошедших курс"


