#language:ru

Функционал: Переход по ссылкам в компоненте footer
  Для того, чтобы можно было ознакомиться с информацией о сайте и команде
  Я, являясь анонимным пользователем, должен иметь возможность переходить по ссылкам в footer:

  @footer
  Сценарий: Переход по ссылкам в компоненте footer
    Допустим я нахожусь на странице "Главная"
    Если в футере я нажимаю на ссылку "Помощь"
    Тогда я нахожусь на странице "Помощь"
    Если в футере я нажимаю на ссылку "О проекте"
    Тогда я нахожусь на странице "О проекте"
    Если в футере я нажимаю на ссылку "Конфиденциальность"
    Тогда я нахожусь на странице "Конфиденциальность"
    Если в футере я нажимаю на ссылку "Условия"
    Тогда я нахожусь на странице "Условия"
    Если в футере я нажимаю на ссылку "Разработка"
    Тогда я нахожусь на странице "Разработка"
    Если в футере я нажимаю на ссылку "Связаться с нами"
    Тогда я нахожусь на странице "Связаться с нами"
    Если в футере я нажимаю на ссылку "Тарифы"
    Тогда я нахожусь на странице "Тарифы"
