#language:ru

Функционал: Страница "Мои курсы"
  Для того, чтобы видеть курсы, которые прохожу и хочу пройти
  Как обычный пользователь
  Я должен иметь возможность просматривать

  @learningCourses
  Сценарий: Курсы, которые прохожу
    Допустим я залогиненный "пользователь"
    Допустим я добавил курс на страницу "Мои курсы"

  @favoriteCourses
  Сценарий: Курсы, которые хочу пройти
    Допустим я залогиненный "пользователь"
    Допустим я добавил курс на страницу "Мои курсы,избранное"

  @takeTheCourse
  Сценарий: Пройти курс
    Допустим я залогиненный "пользователь"
    Допустим я добавил курс на страницу "Мои курсы"
    Допустим я прошел курс